cmsis-svd/cmsis-svd/data/Microchip/ATSAMS70JxB.svd
                              <description>AES_RX</description>
                              <value>38</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWM1</name>
                              <description>PWM1</description>
                              <value>39</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0</name>
                              <description>TC0</description>
                              <value>40</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC3</name>
                              <description>TC3</description>
                              <value>41</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC6</name>
                              <description>TC6</description>
                              <value>42</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC9</name>
                              <description>TC9</description>
                              <value>43</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CDS_MSP</name>
                  <description>Channel Data Stride Memory Set Pattern</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SDS_MSP</name>
                        <description>Channel x Source Data stride or Memory Set Pattern</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DDS_MSP</name>
                        <description>Channel x Destination Data Stride or Memory Set Pattern</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CSUS</name>
                  <description>Channel Source Microblock Stride</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SUBS</name>
                        <description>Channel x Source Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CDUS</name>
                  <description>Channel Destination Microblock Stride</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>DUBS</name>
                        <description>Channel x Destination Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral>
         <name>SCnSCB</name>
         <description>System control not in SCB</description>
         <groupName>SCnSCB</groupName>
         <prependToName>SCnSCB_</prependToName>
         <baseAddress>0xE000E000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ICTR</name>
               <description>Interrupt Controller Type Register</description>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>INTLINESNUM</name>
                     <description>Total number of interrupt lines supported by an implementation, defined in groups of 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACTLR</name>
               <description>Auxiliary Control Register</description>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>DISFOLD</name>
                     <description>Disables folding of IT instructions</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPEXCODIS</name>
                     <description>Disables FPU exception outputs</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISRAMODE</name>
                     <description>Disables dynamic read allocate mode for Write-Back Write-Allocate memory regions</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISITMATBFLUSH</name>
                     <description>Disables ITM and DWT ATB flush</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISBTACREAD</name>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISBTACALLOC</name>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCRITAXIRUR</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISDI</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DISISSCH1</name>
                     <bitOffset>21</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DISDYNADD</name>
                     <description>Disables dynamic allocation of ADD and SUB instructions</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISCRITAXIRUW</name>
                     <description>Disable critical AXI read-under-write</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISFPUISSOPT</name>
                     <description>Disables dynamic allocation of ADD and SUB instructions</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
